tests/harmonic/0/U
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (2 0 0);

boundaryField
{
    Cylinder
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }
    Inlet
    {
        type            fixedValue;
        value           uniform (2 0 0);
    }
    Outlet
    {
        type            zeroGradient;
    }
    "(Front|Back|Top|Bottom)"
    {
        type            slip;
    }
}


// ************************************************************************* //
