tests/harmonic/0/heightFractionMatching
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointScalarField;
    location    "0";
    object      heightFractionMatching;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];


internalField   nonuniform List<scalar> 
386220
(
0
0
0
0
0
0
0
0
...
)
;

boundaryField
{
    Back
    {
        type            calculated;
    }
    Bottom
    {
        type            calculated;
    }
    Cylinder
    {
        type            calculated;
    }
    Front
    {
        type            calculated;
    }
    Inlet
    {
        type            calculated;
    }
    Outlet
    {
        type            calculated;
    }
    Top
    {
        type            calculated;
    }
}


// ************************************************************************* //
